import React from 'react';
import 'bootstrap/dist/css/bootstrap.min.css'; 

function PrivacyPolicy() {
  return (
    <div className="container mt-5">
      <h1 className="mb-4">Политика конфиденциальности</h1>

      <section className="mb-4">
        <h2 className="h4">1. Общие положения</h2>
        <p>
          Настоящая Политика конфиденциальности определяет порядок обработки и защиты информации о пользователях, которую ООО "Вентиндустрия" получает при использовании веб-сайта .  
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">2. Сбор и использование персональной информации</h2>
        <p>
          Мы собираем и используем персональную информацию пользователей в следующих целях:
          <ul>
            <li>Обеспечение функционирования Сайта.</li>
            <li>Предоставление пользователям информации о наших товарах и услугах.</li>
            <li>Улучшение качества Сайта и предоставляемых услуг.</li>
             
          </ul>
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">3. Виды собираемой информации</h2>
        <p>
          Мы можем собирать следующую информацию о пользователях:
          <ul>
            <li>Имя и фамилия.</li>
            <li>Адрес электронной почты.</li>
            <li>Номер телефона.</li>
            <li>IP-адрес.</li>
            <li>Информация о браузере и операционной системе.</li>
              
          </ul>
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">4. Передача персональной информации третьим лицам</h2>
        <p>
          Мы можем передавать персональную информацию пользователей третьим лицам только в следующих случаях:
          <ul>
            <li>Когда это необходимо для обеспечения функционирования Сайта (например, хостинг-провайдеру).</li>
            <li>Когда это требуется в соответствии с законодательством.</li>
            <li>С согласия пользователя.</li>
          </ul>
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">5. Защита персональной информации</h2>
        <p>
          Мы принимаем необходимые меры для защиты персональной информации пользователей от несанкционированного доступа, использования, раскрытия или уничтожения.  Опишите ваши меры безопасности.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">6. Cookies</h2>
        <p>
          Мы используем файлы cookie для улучшения работы Сайта.  
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">7. Изменения в Политике конфиденциальности</h2>
        <p>
          Мы можем вносить изменения в настоящую Политику конфиденциальности в любое время. Новая редакция Политики вступает в силу с момента ее опубликования на Сайте.
        </p>
      </section>

      <section className="mb-4">
        <h2 className="h4">8. Контактная информация</h2>
        <p>
          Если у вас есть какие-либо вопросы или предложения относительно настоящей Политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу: info@ventindusty.com. 
        </p>
      </section>

      <p>Дата публикации: 23 ноября 2025</p>
    </div>
  );
}

export default PrivacyPolicy;
